[
  {
    "path": "posts/2021-01-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This is the first assignment on Data Visualization!",
    "author": [
      {
        "name": "Elaine Lee",
        "url": "https://example.com/elainelee"
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\n1.0 Critic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nThe Report on Labour Force in Singapore is a key annual report on Singapore’s labour market.\r\nBelow is the extract of chart obtained from the Report: Labour Force in Singapore 2019.\r\nInitial ChartClarity\r\nThe chart title indicates “Resident labour force by age” but does not explain if it is showing counts or percentages on the line chart. There are no label added to the data points as well, hence hindering the proper interpretation of data.\r\nThe lead-in paragraph explained the relationship between resident labour force for different age group and labour force participation rate (LFPR).\r\nHowever, there is no separate visuals created in the chart that depicts LFPR.\r\nHence, unable to clearly identify the correlation between resident labour force and LFPR.\r\nThe lead-in paragraph explained the increment of median age of residents in the labour force.\r\nHowever, the median age is simply an indication on the chart and does not provide any meaning to the interpretation of chart. Also, the source of the data for median age is not stated.\r\nThe narrative compared the increment of resident labour force aged 55 and over and decline of resident labour force aged 25 to 54.\r\nHowever, the chart depicts the time series data; in this case, a 5-year age bands were used.\r\nHence, there is no standardization of age bands as explained in the lead-in paragraph and chart, and this may hinder the proper interpretation of data.\r\nAesthetics\r\nThere is no vertical axis in the chart. Hence, unable to clearly understand what the data is about.\r\nThere is no axis title for both horizontal and vertical axis. Hence unable to clearly understand what the data is about.\r\nData Labels (for example, percentage of resident labour force) are not displaying for all the data points on the line chart. Rather, it is displayed in a table format below the chart. Hence, unable to facilitate easy reading of data points.\r\nThere are clear direct labels on the line charts indicating June 2009 and June 2019.\r\nThe use of 2 different colours is to visually identify the trend for two years, 2009 and 2019. No overuse of colour as Blue and Grey fits well together.\r\nThere is clear indication of data source stated in the chart.\r\n2.0 With reference to the critics above, suggest alternative graphical presentation to improve current design. The proposed alternative data visualization must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nClarity\r\nTo modify the title to “Resident Labour Force in Percentage” to clearly reflect that the data presented is in percentage.\r\nTo add another bar graph to show the percentage of Labour Force Participation Rate.\r\nThis allows user to identify the relationship between Labour Force Participation Rate and Resident labour force for different age group.\r\nTo remove median age from the chart as it does not serve any meaningful interpretation to the data.\r\nTo create 3 age bands (for example, age bands between 0 to 24, 25 to 54 and 55 & over) for comparing characteristics across time period.\r\nAesthetics\r\nTo show the vertical axis (in percentage) on the line chart.\r\nTo add axis titles to horizontal (i.e. Age Group) and vertical axes. (i.e. Percentage of resident labour force)\r\nTo display the data points in percentage for all values in the line chart.\r\nContinue to add legends in the chart.\r\nContinue to use contrasting colours for differentiation between time period.\r\nContinue to include data source in the chart.\r\nSketch of Proposed Design\r\nSketchIn order to clearly explain the changes of labour force participation rate and resident labour force for 2-year period across all age bands, there are proposed 3 charts instead of 1 chart as shown in the initial visualization.\r\nAll charts are clearly displayed with relevant chart title, axis labels, mark labels and legend to provide user with visual clues to better understand and interpret the data.\r\nAll age groups are classified into 3 distinct age band (15-24, 25-54, 55&above) so that user can directly relate to the lead-in paragraph.\r\n3.0 Using Tableau, design the proposed data visualization.\r\nData Visualization can be found in Tableau Public: https://public.tableau.com/profile/elaine3214#!/vizhome/Book4_16118304881740/Dashboard\r\n4.0 Provide step-by-step description on how the data visualization was prepared.\r\nData Source\r\nData Source is extracted from https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx\r\nTable 5: Resident Labour Force Participation Rate by Age and Sex, 2009-2019 (June)\r\nTable 7: Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009-2019 (June)\r\nData Prepartion\r\nTable 7\r\nConvert data headers to dimensions for source data, Table 7: Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009-2019(June).\r\nCalculate Percentage of Resident Labour Force using the formula; Number of Resident Labour Force divided by Total Resident Labour Force in a new column as per below table:\r\nCalculationRename the file to Table 7.\r\nTable 5\r\nCovert data headers to dimensions for source data, Table 5: Resident Labour Force Participation Rate by Age and Sex, 2009-2019 (June) as per below table:\r\nConvert HeadersRename the file to Table 5.\r\nFor Figure 1: Labour Force Participation Rate\r\nExtract Data\r\nCreate an extract from an excel workbook, Table 5 where all data will be included in the visualization.\r\nExtract DataImport to Tableau\r\nImport Table 5 into tableau:\r\nChange data type for [Year] from Number to Date. \r\nCreate chart to show the Percentage of Labour Force Participation Rate for all Age Group\r\nDrag [Age] and [Year] to Rows and [Percentage of Resident Labour Force] to Columns\r\nFormat horizontal axis’s scale to Percentage with 0 decimal place.\r\nOn the Marks card, click the Marks Type drop-down and select Bar.\r\nFrom the Data Pane, drag [Year] to Colour on the Marks card and edit colours to differentiate two-year period.\r\nUnder the [Year] filter, select the year option.\r\nPicture10Create Dual Axis\r\nDrag [Percentage of Resident Labour Force] to Columns and Select Dual Axis.\r\nFormat horizontal axis’s scale to Percentage with 0 decimal place and select Synchronise Axis.\r\nOn the Marks card, click the Marks Type drop-down and select Circle.\r\nFrom the Data Pane, drag [Year] to Colour on the Marks card and edit colours to differentiate two-year period.\r\nFor Figure 2: Resident Labour Force in Percentage\r\nExtract Data\r\nCreate an extract from an excel workbook, Table 7 where all data will be included in the visualization.\r\nPicture3Import to Tableau\r\nImport Table 7 into tableau:\r\nPicture4Change data type for [Year] from Number to Date. \r\nCreate chart to show an overview of the Percentage of Resident Labour Force for all Age Group\r\nDrag [Age] and [Year] to Columns and [Percentage of Resident Labour Force] to Rows.\r\nPicture12Picture13Format horizonal axis’s scale to Percentage with 0 decimal place.\r\nOn the Marks card, click the Marks Type drop-down and select Line.\r\nUnder the [Year] filter, select the year option.\r\nPicture10Create Dual Axis\r\nDrag [Percentage of Resident Labour Force] to Rows and Select Dual Axis.\r\nFormat axis scale to Percentage with 0 decimal place and select Synchronise Axis.\r\nOn the Marks card, click the Marks Type drop-down and select Circle.\r\nFrom the Data Pane, drag [Year] to Colour on the Marks card and edit colours to differentiate two-year period.\r\nFor Figure 3: Resident Labour Force in Percentage for Age Groups 15-24,25-54 and 55&over\r\nCreate chart to show the breakdown of the Percentage of Resident Labour Force for 3 Age Groups\r\nDrag [Age] and [Year] to Columns and [Percentage of Resident Labour Force] to Rows\r\nPicture12Picture13Format horizontal axis’s scale to Percentage with 0 decimal place.\r\nOn the Marks card, click the Marks Type drop-down and select Line.\r\nCreate Dual Axis\r\nDrag [Percentage of Resident Labour Force] to Rows and Select Dual Axis\r\nFormat horizontal axis’s scale to Percentage with 0 decimal place and select Synchronise Axis.\r\nOn the Marks card, click the Marks Type drop-down and select Circle.\r\nFrom the Data Pane, drag [Year] to Colour on the Marks card and edit colours to differentiate two-year period.\r\nStandardized Age Group\r\nIn order to group the age into different age bands, select the range of dates in the axis and right-click the group field, and then rename it to 3 age groups (namely 15-24, 25-54 and 55 & over).\r\nFormat for all charts\r\nOn the Marks card, click Label and then select Show mark labels.\r\nRemove the grid lines and make the data present cleaner. Navigate to Format and click on lines and set grid lines as None in Rows.\r\nFor all charts, drag [Years] to Color under the Marks Card and select diverging color palette to identify respective years.\r\nCreate New Dashboard\r\nDrag all above 3 charts to the Dashboard for further analysis.\r\nFinal visualization output as follows: \r\n5.0 Describe three major observations revealed by the data visualisation prepared.\r\nDefinition of labour force and labour force participation rate (extracted from Ministry of Mapower website1):\r\nThe labour force, also known as the economically active population, refers to the manpower currently available in the economy. It comprises people who are working or seeking work (i.e. the employed and the unemployed).\r\nThe labour force participation rate measures the proportion of working-age population that engages actively in the labour market, either by working or looking for work.\r\nThree Major Observations\r\nFrom Figure 1: Labour Force Participation Rate, the labour force participation rate rose for all age groups in June 2009 and June 2019 with the exception of residents aged 20-24 where labour force participation rate declined from 64% to 61% in June 2019, reflecting the longer-term for youths to enter the workforce at a later age probably due to the pursue of higher education.\r\nOver the same period, the labour force participation rate for residents aged 55 and above trended upwards. In particular, participation rate for residents aged 65-69 increased significantly from 30% in June 2009 to 46% in June 2019. This is supported by Government’s initiatives to encourage older workers to remain or re-join the workforce. There are policies such as the increase in the CPF contribution rates2 (by 2% for age group 55 and above), changes to retirement age 3 (from 62 to 63 years old by 1 July 2022 and to 70 years old by 2030) for older workers as well as Special Employment Credit 4 to encourage employers to hire older workers.\r\nThe resident labour force continued to age. With the population ageing and increased in labour force participation rate among older residents, the median age of the resident labour force rose from 41 years in 2009 to 44 years in 2019.\r\nEvident from Figure 2: Resident Labour Force in Percentage, the proportion of resident labour force increased by 2% for residents with age group above 55. In constrast, the proportion of resident labour force fell for residents across age bands from 20-54 although labour force participation rate increased. This could be due to their shrinking population size. Notably, the proportion of resident labour force remained constant at 2% for residents aged 15-19.\r\nEvident from Figure 3: Resident Labour Force in Percentage for Age Groups 15-24,25-54 and 55&over, one in four (25%) residents in the labour force in 2019 were aged 55 and above, up from 16% in 2009. In constrast, the proportion of residents aged 15-24 decline from 9% in 2009 to 8% in 2019 and those residents aged 25-54 from 75% in 2009 to 67% in 2019.\r\nhttps://stats.mom.gov.sg/Pages/Labour-Force-Summary-Table.aspx↩︎\r\nhttps://www.mom.gov.sg/-/media/mom/documents/press-releases/2019/0819-twg-ow-report.pdf↩︎\r\nhttps://www.mom.gov.sg/-/media/mom/documents/press-releases/2019/0819-twg-ow-report.pdf↩︎\r\nhttps://www.sec.gov.sg/Pages/Home.aspx\r\n\r\n↩︎\r\n",
    "preview": {},
    "last_modified": "2021-01-28T21:29:49+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Visual Analytics",
    "description": "Welcome to Visual Analytics! Discover interesting ideas and perspectives from various makeover and projects!",
    "author": [
      {
        "name": "Elaine Lee",
        "url": "https://example.com/elainelee"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T23:54:55+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "Preview",
    "description": "Hands-on exercise during course preview!",
    "author": [
      {
        "name": "Elaine Lee",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-27T00:10:07+08:00",
    "input_file": "my-first-post.utf8.md"
  }
]
