[
  {
    "path": "posts/2021-02-18-dataviz-makeover-2/",
    "title": "Dataviz Makeover 2",
    "description": "This is the second assignment on Data Visualization!",
    "author": [
      {
        "name": "Elaine Lee",
        "url": "https://example.com/elainelee"
      }
    ],
    "date": "2021-02-18",
    "categories": [],
    "contents": "\r\n1.0 Critic the Graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\n\r\nClarity:\r\nThe stacked bar chart title indicates “Which Country is more pro-vaccine?” but the bar chart is sorted in ascending alphabetical by Y-axis, hence mislead users that Australia is the country that is more pro-vaccine when it is not. There are no labels added to the data points as well, hence hindering the proper interpretation of data.\r\nFor the stacked bar chart indicating “Which Country is more pro-vaccine?”, It is hard to interpret the responses in the middle of the stacked bar as they do not share a common baseline.\r\nThe bar chart indicating “% of strongly agreed to vaccination” shows the breakdown of the percentage of strongly agreed to vaccination for respective countries but does not reflect the number of respondents. Hence, it may mislead user to the wrong conclusion if the sample size is small.\r\nEach chart has a different scale on its horizontal axis. For the stacked bar chart indicating “Which Country is more pro-vaccine?”, the values of the percentage of total record are from 0% to 100% whereas for the bar chart indicating “% of strongly agreed to vaccination”, the values of the percentage of strongly agreed are from 0% to 60%. Hence, making it unclear to user whether the chart is truncated.\r\nThere is inconsistent sort method associated with each chart. For the stacked bar chart indicating “Which Country is more pro-vaccine?”, the country is sorted in ascending alphabetical for the Y-axis while the other bar chart indicating “% of strongly agreed to vaccination”, data is sorted by percentage of strongly agree for the Y-axis in descending order. Hence, it may mislead user that both charts are sorted in the same manner and hinder the proper interpretation of data.\r\nLegend showing Likert scales is incomplete as it only shows “1-Strongly agree” and “5-Strongly disagree”. There are no responses for point values, from 2 to 4.\r\nLegend title indicates as “Vac 1” but there is no explanation of this notation.\r\nAsethetics:\r\nData Labels (for example, Percentage of public who agreed to vaccination) are not displaying for all the data points on the bar charts. Hence, unable to facilitate easy reading of data points.\r\nThe axis labels on both charts are inconsistent as the stacked bar chart is displaying percentage of total records in whole number while the other bar chart is displaying percentage of strongly agreed in one decimal place.\r\nThere is no clear indication of data source stated in the chart.\r\nThe use of colour scheme used on each segment of the stacked bar chart is confusing as there are too many contrasting colour.\r\nThere is a spelling error for the word ‘Vaccine’ which was spelt as ‘Vacinne’ in the chart title.\r\n2.0 With reference to the critics above, suggest alternative graphical presentation to improve current design. The proposed alternative data visualization must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nSketch of Proposed Design: \r\nIn terms of Clarity:\r\nFor the First Chart\r\nA diverging stacked bar is created with the use of two contrasting colour to help user mentally group each half of the diverging stacked bar. Also, to include data labels for all data points.\r\nThe positive and negative percentages are presented using a synchronized dual axis chart. The neutrals are a separate chart that is placed next to this dual axis chart.\r\nNote: (i) “Strongly Disagree” and “Disagree” categories are combined to obtain Percentage Negative. (ii) “Strongly Agree” and “Agree” categories are combined to obtain Percentage Positive.\r\nSubsequently, a histogram bar chart is created to show the breakdown of responses for all point values on a Likert scale (“1-Strongly agree”, “2-Agree”,“3-Neutral”,“4-Disagree”,“5-Strongly disagree”) when user hovers over the stacked bar.\r\nIn order to build a dashboard that is interactive, parameter actions such as filters are used. For instance, user can select the survey questions using a parameter control to change the type of question. (i.e. Vac_1 is renamed to “If a Covid-19 vaccine were made available to me this week, I would definitely get it”.) For the purpose of further analysis, data collected from vac2_1, vac2_2, vac2_3, vac2_6 and vac3 are used.\r\nFor the Second Chart\r\nIn order not to mislead user into thinking that they can conclude more than the data allows, the results are presented with confidence intervals (i.e. at 90%/95%/99% confidence interval).\r\nIn order to build a dashboard that is interactive, parameter actions such as filters are used. For instance, user can select the date using a parameter control to change the Month of Year (i.e. January 2021).\r\nIn terms of Asethetics:\r\nAll Data points are consistently labelled in percentage in 0 decimal place, Chart title is included, and Axis title are properly labelled for better visualization of data.\r\nData source is clearly stated in the chart. Link as follows: https://github.com/YouGov-Data/covid-19-tracker/tree/master/data.\r\nFor better visualisation of the histogram bar chart, sequential colour scheme is applied. Recolour each segment of the stack from darkest to lightest shades of one colour to differentiate Positive sentiment, Neutral and Negative sentiment.\r\n3.0 Using Tableau, design the proposed data visualization\r\nData Visualization can be found in Tableau Public Server: https://public.tableau.com/profile/elaine3214#!/vizhome/Dataviz2_16136800084340/Dashboard1?publish=yes\r\n4.0 Provide step-by-step description on how the data visualization was prepared\r\nData Sources\r\nData Sources are extracted from https://github.com/YouGov-Data/covid-19-tracker/tree/master/data.\r\nData Preparation\r\nFor CSV files:\r\nUnzip the zip files of Australia, Denmark, France, Germany, Italy, Norway, Singapore, Sweden and United Kingdom which was downloaded from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted at Github. Save all 14 CSV files (comprised of Australia, Canada, Denmark, Finland, France, Germany, Italy, Japan, Netherlands, Norway, Singapore, South Korea, Sweden and United Kingdom) in a folder.\r\nThere were multiple columns of field name “employment_status” for Denmark, Finland, Norway and Sweden CSV files.\r\nThe below formula was used to combine data from multiple columns into one column to reflect the correct Employment Status for Norway’s CSV files. Apply similar formula for Denmark, Finland, and Sweden CSV files.\r\nFormula: IF(MATCH(“Yes”,CA2:CG2,0)=1,“Full time employment”,IF(MATCH(“Yes”,CA2:CG2,0)=2,“Part time employment”,IF(MATCH(“Yes”,CA2:CG2,0)=3,“Full time student”,IF(MATCH(“Yes”,CA2:CG2,0)=4,“Retired”,IF(MATCH(“Yes”,CA2:CG2,0)=5,“Unemployed”,IF(MATCH(“Yes”,CA2:CG2,0)=6,“Not working”,IF(MATCH(“Yes”,CA2:CG2,0)=7,“Other”,0)))))))\r\nRename CSV files to “Denmark_cleaned”, “Finland_cleaned”, “Norway_cleaned” and “Sweden_cleaned”.\r\nNext, remove the column field name “household_children_resp” for Australia’s CSV file as there are no values and there is already a similar column field name “household_children” with valid values.\r\nFor Tableau:\r\nGo to File and open the folder where all 14 CSV files are kept and double click on any one of the CSV files. All the CSV files in the folder will be automatically be listed in Tableau.\r\nNext, manually union distinct tables. On the Data Source page, double click on New Union to set up the union. Select all tables to union in the left pane and then drag them directly below the first table.\r\n\r\nClick Apply and Ok to union.\r\nManage Metadata\r\nTo hide multiple columns as not relevant for analysis by clicking on the drop-down arrow next to a column name and then select “Hide”. Hence, retaining the relevant columns as shown in the screenshot below. To rename column for better visualization; Double-click Table Name column and rename to “Country” for the last field name.\r\n\r\nPivot\r\nOn the Data Source page, select columns on vac_1,vac2_1,vac2_2,vac2_3,vac2_6 and vac_3. Right-click and select Pivot. Rename the new pivot fields to “Survey Answer” and “Survey Question”.\r\n\r\nTableau Works\r\nCreate an Extract: After setting up the data source on the Data Source page, in the upper-right corner, select Extract to include all data.\r\n\r\nEdit Alias: Click on the worksheet. In the Data pane, right-click on Country and select Aliases. In the Edit Aliases dialog box, amend the Value (Alias) to the respective country names.\r\n\r\nIn the Data pane, right-click on “Survey Answer”. In the Edit Aliases dialog box, amend the Value (Alias) to the following responses ranges from 1=“Strongly agree”, 2=“Agree”, 3=“Neutral”, 4=“Disagree” and 5=“Strongly disagree”.\r\n\r\nIn the Data pane, right-click on “Survey Question” and select Aliases. In the Edit Aliases dialog box, amend the Value (Alias) to the following responses ranges.\r\n\r\nCreate Calculated Field: Select Analysis and click on Create Calculated Field.\r\nIn the Calculation Editor that opens, give the calculated field a name and enter a formula or value. When finished, click Ok.\r\nCalculated field is called “Score”. It is to extract integer responses from the survey.\r\n\r\nCalculated field is called “Number of Records” and enter a value 1.\r\n\r\nCalculated field is called “Percentage Positive” and is defined as:\r\n\r\nCalculated field is called “Percentage Negative” and is defined as:\r\n\r\nCalculated field is called “Percentage Neutral” and is defined as:\r\n\r\nInsert Variables: Drag [Percentage Positive], [Percentage Negative] and [Percentage Neutral] to the Columns shelf and Drag [Country] to the Rows shelf.\r\n\r\nFormat: Format the x-axis to fixed at -1 to 0 for [Percentage Negative] and x-axis to fixed at 0 to 1 for [Percentage Positive] and [Percentage Neutral]. Format the axis scale to display Percentage in whole number.\r\n\r\n\r\n\r\nCreate views in Tooltips: When a user hovers over a mark, the tooltip will display relevant details (For this case, to display bar charts to show all levels of sentiment for positive and negative) from another visualization.\r\nCreate a visualization in a target worksheet view to serve as the Visualization in Tooltip. Rename the Worksheet as ‘Tooltip’.\r\nDrag [Survey Answer] to the Columns shelf and [Number of Records] to the Rows shelf. Right-click on [Number of Records] and select Percent of Total under Quick Table Calculation.\r\n\r\nOn the Marks card, drag [Survey Answer] onto Colour and edit colours to select contrasting colours.\r\n\r\nFormat to show mark labels on all bar charts by selecting Label on the Marks card.\r\n\r\nFinal visualization of the chart is as follows: \r\nIn the Source Worksheet, Select Tooltip on the Marks card. In the Tooltip Editor, insert a reference to the Visualization in Tooltip target worksheet.\r\n\r\nFinal Visualization of the chart showing the breakdown of responses on a five-point Likert scale when user hovers over bar is as follows. Chart title is included and a text box is inserted to describe what is displayed in the visualization.\r\n\r\n\r\nTo Display Standard errors and Confidence intervals in Tableau\r\nCreate Confidence interval bars:\r\nCreate the necessary Calculated Field: Select Analysis and click Create Calculated Field.\r\nCreate calculated field – Score-Strongly Agree: To extract the percentage of survey responses who strongly agreed to vaccination, create the calculated field “Score-Strongly Agree” with calculation as follows:\r\nif[Score]=1 THEN 1\r\nelse 0\r\nend\r\nCreate calculated field – Proportion: Create the calculated field “Proportion” with calculation as follows:\r\nSUM([Score-Strongly Agree])/SUM([Number of Records])\r\nCreate calculated field – Standard Error: Create the calculated field “Proportion_SE” with calculation as follows:\r\nsqrt(([Proportion]*(1-[Proportion]))/sum([Number of Records]))\r\nCreate calculate field-Z Value for 90% confidence interval: Create the calculated field “Z_90%” with value as follows: 1.64485\r\nCreate calculated field – Z Value for 95% confidence interval: Create the calculated field “Z_95%” with value as follows: 1.959964\r\nCreate calculated field – Z Value for 99% confidence interval: Create the calculated field “Z_99%” with value as follows: 2.575829\r\nCreate a parameter to select confidence interval: In the Data pane, click the drop-down arrow in the upper right corner and select Create Parameter. Select the Data type as “String” and Allowable values as “List”. Edit the List of Values as follows:\r\n\r\nCreate calculated field to select vary confidence interval:\r\n\r\nCreate upper and lower limit for the confidence interval:\r\nCreate the calculated field “Upper Bound of Confidence Interval” with calculation as follows: [Proportion]+[CI]*[Proportion_SE]\r\nCreate the calculated field “Lower Bound of Confidence Interval” with calculation as follows: [Proportion]-[CI]*[Proportion_SE]\r\nInsert Variables\r\nDrag [Measure Values] to the Columns shelf and Drag [Country] to the Rows shelf.\r\n\r\nOn the Marks card, select Line from the Dropdown.\r\n\r\nRemove unnecessary Measure Values and the following are retained:\r\n\r\nDrag [Measure Names] onto Size, Colour and Path on the Marks card. Click Size on the Marks card and adjust the slider to the desired thickness. Click on Colour and select contrasting colours to match the [Measure Names].\r\n\r\nDrag [Proportion] to the Columns shelf. Right-click and check Dual Axis. On the axis, right-click and select Synchronize Axis. On the Marks card, select Circle from the Dropdown. Click Size on the Marks card and adjust the slider to the desired size.\r\n\r\nFix the axis range to Automatic. Rename x-axis to “Percentage of Respondents who Strongly Agree”.\r\n\r\nRight-click on the Grand Total and Select Column Totals to Top.\r\n\r\nOn the Marks card, select Tooltip and edit to display the following details:\r\n\r\nEdit the Title of the chart as follows:\r\n\r\nThe Final Visualization of the chart is as follows:\r\n\r\nDashboard\r\nCreate Dashboard\r\nAt the bottom of the workbook, click the New Dashboard icon. From the Sheets list at the left pane, drag both worksheets to the Dashboard.\r\n\r\nEdit the title of the Dashboard to “Public willingness on Covid-19 vaccination Survey Report”.\r\nRemove filters such as Measure Names and include the following fields; age (group according to 18-58 and 59-99), employment_status (rename to Employment Status), household_size (Household Size), gender (Gender),endtime (rename to Month-Year) and household_children (rename to Household Children) to filters (on the right pane) to create an interactive Dashboard.\r\nAdd in Data Source at the bottom of the Dashboard: https://github.com/YouGov-Data/covid-19-tracker/tree/master/data.\r\nSelect every filter on the right pane and click on the left arrow indicating “More Options”. Select “Apply to Worksheets” and click on “All Using This Data Source”.\r\n\r\nInclude animations for better visualization. Under Format, select Animations. Enable animations by setting the Workbook Default to “On” for duration 0.30 seconds.\r\n\r\nFinal Visualization of the Dashboard is as follows:\r\n\r\n5.0 Describe three major observations revealed by the data visualisation prepared.\r\nWith Covid-19 vaccines currently being rolled out across the world, countries in Europe such United Kingdom, Demark and Netherlands are most willingly to take the vaccine. Based on the survey question, “if a Covid-19 vaccine were made available to me this week, I would definitely get it”, 78% of the respondents from United Kingdom responded “Agree” or “Strongly Agree” based on the survey conducted in January 2021, compared to 71% in December 2020. This is supported by the fact that 16 million people across United Kingdom have now received their first dose of the vaccine according to the statistics extracted from https://coronavirus.data.gov.uk/details/vaccinations.\r\n\r\nFor Singapore, based on the survey question, “if a Covid-19 vaccine were made available to me this week, I would definitely get it”, the percentage of respondents who are willingly to be vaccinated is 36% based on the survey conducted in January 2021. On the other hand, 29% of the respondents are not willing to take a Covid-19 vaccine and 35% were undecided. The percentages do not differ much significantly mainly due to public approach of wait-and-see attitude and reservations among Singaporeans toward the vaccine. However, there have been efforts done by the Government to encourage the take-up of Covid-19 vaccine such as going door-to-door to address concerns.\r\n\r\nFurther analysis was conducted based on the number of people in household. Typically, based on the survey question conducted in January 2021, “if a Covid-19 vaccine were made available to me this week, I would definitely get it”, the uncertainty in the responses who selected ‘Strongly Agree’ for household size of 5 is larger than the responses for household size of 3 as shown in the screenshots below. The above results are based on 95% confidence level. This could be due to the different levels of mistrust of vaccine benefit and concerns of potential side effects of a Covid-19 vaccine within the family members.\r\n\r\nEvident from another survey question, “I am worried about the potential side effects of a Covid-19 vaccine”, the uncertainty in the responses who selected ‘Strongly Agree’ for household size of 5 is also larger than the responses for household size of 3.\r\n\r\nFrance has a long history of distrusting vaccines. It is evident from the Survey question, “If I do not get a Covid-19 vaccine when it is available, I will regret it” that 45% of the respondents strongly disagree or disagree with the statement. It has the highest proportion as compared to other countries in Europe. In addition, Females expressed more negative sentiment than Males; 45% as compared to 38%. It could be explained because women typically have lower confidence in vaccines. It could also be explained by women being less at risk of developing severe Covid-19. Indeed, vaccine hesitancy in France is nothing new and is indeed one of the main challenges faced by the Government.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T19:46:17+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This is the first assignment on Data Visualization!",
    "author": [
      {
        "name": "Elaine Lee",
        "url": "https://example.com/elainelee"
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\n1.0 Critic the Graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nThe Report on Labour Force in Singapore is a key annual report on Singapore’s labour market.\r\nBelow is the extract of chart obtained from the Report: Labour Force in Singapore 2019.\r\nInitial ChartClarity:\r\nThe chart title indicates “Resident labour force by age” but does not explain if it is showing counts or percentages on the line chart. There are no label added to the data points as well, hence hindering the proper interpretation of data.\r\nThe lead-in paragraph explained the relationship between Resident Labour Force for different age group and Labour Force Participation Rate (LFPR).\r\nHowever, there is no separate visuals created in the chart that depicts LFPR.\r\nHence, unable to clearly identify the correlation between Resident Labour Force and LFPR.\r\nThe lead-in paragraph explained the increment of median age of residents in the labour force.\r\nHowever, the median age is simply an indication on the chart and does not provide any meaning to the interpretation of the chart. Also, the source of the data for median age is not provided.\r\nThe lead-in paragraph compared the increment of Resident Labour Force aged 55 and over and decline of Resident Labour Force aged 25 to 54.\r\nHowever, the chart depicts the time series data; in this case, a 5-year age bands were used.\r\nHence, there is no standardization of age bands as explained in both lead-in paragraph and chart, and this may hinder the proper interpretation of data.\r\nAesthetics:\r\nThere is no vertical axis in the chart. Hence, unable to clearly understand what the data is about.\r\nThere is no axis title for both horizontal and vertical axis. Hence unable to clearly understand what the data is about.\r\nData Labels (for example, percentage of Resident Labour Force) are not displaying for all the data points on the line chart. Rather, it is displayed in a table format below the chart. Hence, unable to facilitate easy reading of data points.\r\nThere are clear direct labels on the line charts indicating June 2009 and June 2019.\r\nThe use of 2 different colours is to visually identify the trend for two years, 2009 and 2019. No overuse of colour as Blue and Grey fits well together.\r\nThere is clear indication of data source stated in the chart.\r\n2.0 With reference to the critics above, suggest alternative graphical presentation to improve current design. The proposed alternative data visualization must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nClarity:\r\nTo modify the chart title to “Resident Labour Force in Percentage” to clearly reflect that the data presented is in percentage.\r\nTo add another bar graph to show the percentage of Labour Force Participation Rate (LFPR).\r\nThis allows user to identify the relationship between LFPR and Resident Labour Force for different age group.\r\nTo remove median age from the chart as it does not serve any meaningful interpretation to the data.\r\nTo create 3 distinct Age Groups (for example, Age Groups between 0 to 24, 25 to 54 and 55 & over) for comparing characteristics across time period.\r\nAesthetics:\r\nTo show the vertical axis (in percentage) on the line chart.\r\nTo add axis titles to horizontal (i.e. Age Group) and vertical axes (i.e. Percentage of Resident Labour Force).\r\nTo display the data points in percentage for all values in the line chart.\r\nContinue to add legends in the chart.\r\nContinue to use contrasting colours for differentiation between time period.\r\nContinue to include data source in the chart.\r\nSketch of Proposed Design:\r\nSketchIn order to clearly compare the changes of Labour Force Participation Rate and Resident Labour Force for 2-year period across all age groups, 3 individual charts are proposed instead of 1 chart as shown in the initial visualization.\r\nAll charts are clearly displayed with relevant chart title, axis labels, mark labels and legend to provide user with visual clues to better understand and interpret the data.\r\nAll age groups are classified into 3 distinct age groups (15-24, 25-54, 55&above) so that user can directly relate to the information described in the lead-in paragraph.\r\n3.0 Using Tableau, design the proposed data visualization.\r\nData Visualization can be found in Tableau Public Server: https://public.tableau.com/profile/elaine3214#!/vizhome/Book4_16118304881740/Dashboard\r\n4.0 Provide step-by-step description on how the data visualization was prepared.\r\nData Sources\r\nData Sources are extracted from https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx\r\nTable 5: Resident Labour Force Participation Rate by Age and Sex, 2009-2019 (June)\r\nTable 7: Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009-2019 (June)\r\nData Preparation\r\nTable 7\r\nConvert data headers to dimensions for source data, Table 7: Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009-2019(June).\r\nCalculate Percentage of Resident Labour Force using the formula; Number of Resident Labour Force divided by Total Resident Labour Force in a new column as per below table:\r\nTable 7Rename the file to Table 7.\r\nTable 5\r\nConvert data headers to dimensions for source data, Table 5: Resident Labour Force Participation Rate by Age and Sex, 2009-2019 (June) as per below table:\r\nTable 5Rename the file to Table 5.\r\nFor Figure 1: Labour Force Participation Rate\r\nExtract Data\r\nCreate an extract from an excel workbook, Table 5 where all data will be included in the visualization.\r\nExtract DataImport to Tableau\r\nImport Table 5 into Tableau:\r\nChange data type for [Year] from Number(whole) to Date. \r\nCreate chart to show the Percentage of Labour Force Participation Rate for all Age Groups\r\nDrag [Age] and [Year] to Rows and [Percentage of Resident Labour Force] to Columns.\r\nTablesColumns&RowsFormat horizontal axis’s scale to Percentage with 0 decimal place.\r\nFormat Horizontal AxisOn the Marks card, click the Marks Type drop-down and select Bar.\r\nSelect BarFrom the Data Pane, drag [Year] to Colour on the Marks card and edit colours to differentiate two-year period.\r\nColourUnder the [Year] filter, select the Year option.\r\nSelect YearCreate Dual Axis\r\nDrag [Percentage of Resident Labour Force] to Columns and right-click to select Dual Axis from the drop-down.\r\nFormat horizontal axis’s scale to Percentage with 0 decimal place and select Synchronise Axis. Right click on the axis and untick Show Header.\r\nOn the Marks card, click the Marks Type drop-down and select Circle.\r\nFrom the Data Pane, drag [Year] to Colour on the Marks card and edit colours to differentiate two-year period.\r\nFor Figure 2: Resident Labour Force in Percentage\r\nExtract Data\r\nCreate an extract from an excel workbook, Table 7 where all data will be included in the visualization.\r\nExtract DataImport to Tableau\r\nImport Table 7 into Tableau:\r\nTable 7Change data type for [Year] from Number(whole) to Date. \r\nCreate chart to show an overview of the Percentage of Resident Labour Force for all Age Groups\r\nDrag [Age] and [Year] to Columns and [Percentage of Resident Labour Force] to Rows.\r\nData&TablesColumns&RowsFormat horizonal axis’s scale to Percentage with 0 decimal place.\r\nOn the Marks card, click the Marks Type drop-down and select Line.\r\nUnder the [Year] filter, select the Year option.\r\nCreate Dual Axis\r\nDrag [Percentage of Resident Labour Force] to Rows and Select Dual Axis.\r\nFormat axis scale to Percentage with 0 decimal place and select Synchronise Axis.Right click on the axis and untick Show Header.\r\nOn the Marks card, click the Marks Type drop-down and select Circle.\r\nFrom the Data Pane, drag [Year] to Colour on the Marks card and edit colours to differentiate two-year period.\r\nFor Figure 3: Resident Labour Force in Percentage for Age Groups 15-24,25-54 and 55&over\r\nCreate chart to show the breakdown of the Percentage of Resident Labour Force for 3 Age Groups\r\nDrag [Age] and [Year] to Columns and [Percentage of Resident Labour Force] to Rows\r\nData&TablesColumns&RowsFormat horizontal axis’s scale to Percentage with 0 decimal place.\r\nOn the Marks card, click the Marks Type drop-down and select Line.\r\nCreate Dual Axis\r\nDrag [Percentage of Resident Labour Force] to Rows and Select Dual Axis.\r\nFormat horizontal axis’s scale to Percentage with 0 decimal place and select Synchronise Axis.Right click on the axis and untick Show Header.\r\nOn the Marks card, click the Marks Type drop-down and select Circle.\r\nFrom the Data Pane, drag [Year] to Colour on the Marks card and edit colours to differentiate two-year period.\r\nStandardized Age Group\r\nIn order to group the age into different age groups, select the range of dates in the axis and right-click the group field, and then rename it to 3 Age Groups (namely 15-24, 25-54 and 55 & over).\r\nFormat for all charts\r\nOn the Marks card, click Label and then select Show mark labels.\r\nRemove the grid lines and make the data present cleaner. Navigate to Format and click on lines and set grid lines as None in Rows.\r\nFor all charts, drag [Year] to Color under the Marks Card and select diverging color palette to identify respective years.\r\nCreate New Dashboard\r\nDrag all above 3 charts to the Dashboard for further analysis.\r\nFinal visualization output as follows: \r\n5.0 Describe three major observations revealed by the data visualisation prepared.\r\nDefinition of labour force and labour force participation rate (extracted from Ministry of Manpower website1):\r\nThe labour force, also known as the economically active population, refers to the manpower currently available in the economy. It comprises people who are working or seeking work (i.e. the employed and the unemployed).\r\nThe labour force participation rate measures the proportion of working-age population that engages actively in the labour market, either by working or looking for work.\r\nThree Major Observations\r\nFrom Figure 1: Labour Force Participation Rate, the labour force participation rate rose for all age groups in June 2009 and June 2019 with the exception of residents aged 20-24 where labour force participation rate declined from 64% to 61% in June 2019, reflecting the longer-term for youths to enter the workforce at a later age probably due to the pursue of higher education.\r\nOver the same period, the labour force participation rate for residents aged 55 and above trended upwards. In particular, participation rate for residents aged 65-69 increased significantly from 30% in June 2009 to 46% in June 2019. This is supported by Government’s initiatives to encourage older workers to remain or re-join the workforce. There are policies such as the increase in the CPF contribution rates2 (by 2% for age group 55 and above), changes to retirement age 3 (from 62 to 63 years old by 1 July 2022 and to 70 years old by 2030) for older workers as well as Special Employment Credit 4 to encourage employers to hire older workers.\r\nThe resident labour force continued to age. With the population ageing and increased in labour force participation rate among older residents, the median age of the resident labour force rose from 41 years in 2009 to 44 years in 2019.\r\nEvident from Figure 2: Resident Labour Force in Percentage, the proportion of resident labour force increased by 2% for residents with age group above 55. In constrast, the proportion of resident labour force fell for residents across age bands from 20-54 although labour force participation rate increased. This could be due to their shrinking population size. Notably, the proportion of resident labour force remained constant at 2% for residents aged 15-19.\r\nEvident from Figure 3: Resident Labour Force in Percentage for Age Groups 15-24,25-54 and 55&over, one in four (25%) residents in the labour force in 2019 were aged 55 and above, up from 16% in 2009. In constrast, the proportion of residents aged 15-24 decline from 9% in 2009 to 8% in 2019 and those residents aged 25-54 from 75% in 2009 to 67% in 2019.\r\nhttps://stats.mom.gov.sg/Pages/Labour-Force-Summary-Table.aspx↩︎\r\nhttps://www.mom.gov.sg/-/media/mom/documents/press-releases/2019/0819-twg-ow-report.pdf↩︎\r\nhttps://www.mom.gov.sg/-/media/mom/documents/press-releases/2019/0819-twg-ow-report.pdf↩︎\r\nhttps://www.sec.gov.sg/Pages/Home.aspx\r\n\r\n↩︎\r\n",
    "preview": {},
    "last_modified": "2021-02-18T17:19:53+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Visual Analytics",
    "description": "Welcome to Visual Analytics! Discover interesting ideas and perspectives from various makeover and projects!",
    "author": [
      {
        "name": "Elaine Lee",
        "url": "https://example.com/elainelee"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T23:54:55+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "Preview",
    "description": "Hands-on exercise during course preview!",
    "author": [
      {
        "name": "Elaine Lee",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-27T00:10:07+08:00",
    "input_file": "my-first-post.utf8.md"
  }
]
